haikevins/stm32f1-register-level-baremetal/05-timer-pwm/platform/device/stm32f103xb/include/stm32f103xb_register_bits.h
#ifndef STM32F103XB_REGISTER_BITS_H
#define STM32F103XB_REGISTER_BITS_H

#include <stdint.h>

/* RCC_CR */
#define STM32_RCC_CR_HSION  (UINT32_C(1) << 0U)
#define STM32_RCC_CR_HSIRDY (UINT32_C(1) << 1U)
#define STM32_RCC_CR_HSEON  (UINT32_C(1) << 16U)
#define STM32_RCC_CR_HSERDY (UINT32_C(1) << 17U)
#define STM32_RCC_CR_PLLON  (UINT32_C(1) << 24U)
#define STM32_RCC_CR_PLLRDY (UINT32_C(1) << 25U)

/* RCC_CFGR */
#define STM32_RCC_CFGR_SW_MASK     (UINT32_C(0x3) << 0U)
#define STM32_RCC_CFGR_SW_HSI      (UINT32_C(0x0) << 0U)
#define STM32_RCC_CFGR_SW_PLL      (UINT32_C(0x2) << 0U)
#define STM32_RCC_CFGR_SWS_MASK    (UINT32_C(0x3) << 2U)
#define STM32_RCC_CFGR_SWS_HSI     (UINT32_C(0x0) << 2U)
#define STM32_RCC_CFGR_SWS_PLL     (UINT32_C(0x2) << 2U)
#define STM32_RCC_CFGR_HPRE_MASK   (UINT32_C(0xF) << 4U)
#define STM32_RCC_CFGR_PPRE1_MASK  (UINT32_C(0x7) << 8U)
#define STM32_RCC_CFGR_PPRE1_DIV1  (UINT32_C(0x0) << 8U)
#define STM32_RCC_CFGR_PPRE1_DIV2  (UINT32_C(0x4) << 8U)
#define STM32_RCC_CFGR_PPRE2_MASK  (UINT32_C(0x7) << 11U)
#define STM32_RCC_CFGR_PLLSRC_HSE  (UINT32_C(1) << 16U)
#define STM32_RCC_CFGR_PLLXTPRE    (UINT32_C(1) << 17U)
#define STM32_RCC_CFGR_PLLMUL_MASK (UINT32_C(0xF) << 18U)
#define STM32_RCC_CFGR_PLLMUL_ENCODE(multiplier) \
    (((uint32_t)((multiplier) - 2U) & UINT32_C(0xF)) << 18U)

/* RCC_APB2ENR */
#define STM32_RCC_APB2ENR_IOPAEN   (UINT32_C(1) << 2U)
#define STM32_RCC_APB2ENR_IOPBEN   (UINT32_C(1) << 3U)
#define STM32_RCC_APB2ENR_IOPCEN   (UINT32_C(1) << 4U)
#define STM32_RCC_APB2ENR_IOPDEN   (UINT32_C(1) << 5U)
#define STM32_RCC_APB2ENR_IOPEEN   (UINT32_C(1) << 6U)
#define STM32_RCC_APB2ENR_USART1EN (UINT32_C(1) << 14U)

/* RCC_APB1ENR */
#define STM32_RCC_APB1ENR_TIM2EN (UINT32_C(1) << 0U)

/* TIMx_CR1 */
#define STM32_TIM_CR1_CEN  (UINT32_C(1) << 0U)
#define STM32_TIM_CR1_ARPE (UINT32_C(1) << 7U)

/* TIMx_EGR */
#define STM32_TIM_EGR_UG (UINT32_C(1) << 0U)

/* TIMx_CCMR1, output compare channel 1 */
#define STM32_TIM_CCMR1_OC1PE       (UINT32_C(1) << 3U)
#define STM32_TIM_CCMR1_OC1M_MASK   (UINT32_C(0x7) << 4U)
#define STM32_TIM_CCMR1_OC1M_PWM1   (UINT32_C(0x6) << 4U)

/* TIMx_CCER */
#define STM32_TIM_CCER_CC1E (UINT32_C(1) << 0U)

/* USART_SR */
#define STM32_USART_SR_PE         (UINT32_C(1) << 0U)
#define STM32_USART_SR_FE         (UINT32_C(1) << 1U)
#define STM32_USART_SR_NE         (UINT32_C(1) << 2U)
#define STM32_USART_SR_ORE        (UINT32_C(1) << 3U)
#define STM32_USART_SR_RXNE       (UINT32_C(1) << 5U)
#define STM32_USART_SR_TC         (UINT32_C(1) << 6U)
#define STM32_USART_SR_TXE        (UINT32_C(1) << 7U)
#define STM32_USART_SR_ERROR_MASK \
    (STM32_USART_SR_PE | STM32_USART_SR_FE | \
     STM32_USART_SR_NE | STM32_USART_SR_ORE)

/* USART_CR1 */
#define STM32_USART_CR1_RE     (UINT32_C(1) << 2U)
#define STM32_USART_CR1_TE     (UINT32_C(1) << 3U)
#define STM32_USART_CR1_RXNEIE (UINT32_C(1) << 5U)
#define STM32_USART_CR1_TXEIE  (UINT32_C(1) << 7U)
#define STM32_USART_CR1_UE     (UINT32_C(1) << 13U)

/* FLASH_ACR */
#define STM32_FLASH_ACR_LATENCY_MASK (UINT32_C(0x7) << 0U)
#define STM32_FLASH_ACR_LATENCY_0    (UINT32_C(0x0) << 0U)
#define STM32_FLASH_ACR_LATENCY_1    (UINT32_C(0x1) << 0U)
#define STM32_FLASH_ACR_LATENCY_2    (UINT32_C(0x2) << 0U)
#define STM32_FLASH_ACR_PRFTBE       (UINT32_C(1) << 4U)

#endif
